<?php
    // Пример функции без аргументов

    $x = 12;    // Объявление переменной x = 12
    $y = 35;    // Объявление переменной y = 35
    
    $sum = $x + $y;    // Объявление переменной sum равной сумме переменных x и y
    
    function printWords () {     // Объявление функции "printWords" без аргумента
        echo "Hello!";           // Вывод сообщения "Hello!"
    }
    
    echo $sum;    // Вывод значения переменной sum    
    
    printWords ();    // Обращение к функции "printWords"
    
    
    echo "<hr>";    // Отделение линией разных примеров кода из урока
    
    
    // Пример функции с аргументом
    function printWords1 ($word) {     // Объявление функции "printWords1" с аргументом $word
        echo "$word";           // Вывод аргумента $word
    }
    
    printWords1 ($sum);    // Обращение к функции "printWords" с $sum в качестве аргумента
    
    
    echo "<hr>";    // Отделение линией разных примеров кода из урока
    
    
    // Пример функции с возвращением значения
    function math ($first, $second) {     // Объявление функции "math" с аргументами  $first и $second
        $summa = $first + $second;           // Объявление переменной summa равной сумме первого и второго аргументов
        return $summa;    // Возврат из функции значения переменной summa
    }    
    
    $sum1 = math($x, $y);    // Объявление переменной sum1 равной значению функции от аргументов $x и $y
    
    printWords1 ($sum1);    // Обращение к функции "printWords" с $sum1 в качестве аргумента
    
    
    echo "<hr>";    // Отделение линией разных примеров кода из урока
    
    
    // Пример функции с обращением из неё к другой функции
    function printWords2 ($x, $y) {     // Объявление функции "printWords1" с аргументом $word
        $word = math($x, $y);        // Присвоение аргументу $word значения функции math от аргументов $x и $y
        echo "$word";           // Вывод аргумента $word
    }
    
    printWords2 ($x, $y);    // Обращение к функции "printWords2" с $x и $y в качестве аргументов

?>