    <?php

    $cost = 10050; // Начальная цена
    $costUp = $cost * 1.13; // Цена с наценкой 13%
    $costUpFloor = ""; // цена округлённая до целой части в меньшую сторону
    
    // Определение разрядности целой части
    $bit = 0;  // РАЗРЯДНОСТЬ ПРОВЕРЯЕМОГО ЧИСЛА
    while (true) {
        if($costUp >= 10**$bit) $bit++;
        else break;
    }

    // Округление до целого в меньшую сторону
    for ($h = $bit; $h >= 1; $h--) {
        $j = 0;
        while ($costUp >= 10**($h-1)){
            $costUp = $costUp - 10**($h-1);
            $j++;
        }
        $costUpFloor .= $j;
    }

    // Выделение копеек
    $ost = $costUpFloor % 100; // выделение двух младших разрядов как копейки
    $ost_1 = $ost % 10;     // определение едениц копеек
    $ost_10 = $ost - $ost_1;    // определение десятков копеек
    
    // Выделение рублей
    $cel = ($costUpFloor - $ost) / 100;
    $cel_1 = $cel % 10;     // определение едениц рублей
    $cel_10 = $cel % 100 - $cel_1;    // определение десятков рублей

    // Определение окончаний слов "копейка" и "рубль"
    $rub = "";
    $kop = "";

    if ($ost_1 == 1 && $ost_10 != 10) $kop = "копейка";
    else if ($ost_1 <= 4 && $ost_10 != 10 && $ost_1 != 0) $kop = "копейки";
    else $kop = "копеек";

    if ($cel_1 == 1 && $cel_10 != 10) $rub = "рубль";
    else if ($cel_1 <= 4 && $cel_10 != 10 && $cel_1 != 0) $rub = "рубля";
    else $rub = "рублей";
    
    // Состовление окончательной фразы
    echo "$cel" . " $rub" . " $ost" . " $kop";
    echo "<br>";
    echo "$cel.$ost руб.";
    ?>

