<?php
    $pass1 = 436;
    $pass2 = 321;

    // Разложение  $pass1 на сотни, десятки и единицы
    $pass1_100 = 0;
    $pass1_10 = 0;
    $pass1_1 = 0;

    while ($pass1 > 100) {
        $pass1 -= 100;
        $pass1_100++;
    }
    while ($pass1 > 10) {
        $pass1 -= 10;
        $pass1_10++;
    }
    $pass1_1 = $pass1;

    // Разложение  $pass2Se на сотни, десятки и единицы
    $pass2_100 = 0;
    $pass2_10 = 0;
    $pass2_1 = 0;

    while ($pass2 > 100) {
        $pass2 -= 100;
        $pass2_100++;
    }
    while ($pass2 > 10) {
        $pass2 -= 10;
        $pass2_10++;
    }
    $pass2_1 = $pass2;

    // Необходимая проверка и вывод результата
    if ($pass1_10 > 5) {
        $pass2Se = $pass2_100 . $pass2_10 . $pass2_1;
        echo "\$pass2Se" . "\"цифра первого разряда из \$pass2\" . \"число второго разряда из \$pass2\" . \"число третьего разряда из \$pass2\"" . " = $pass2Se";
    }
    else {
        $pass2Se = $pass2_10 . $pass2_100 . $pass2_1;
        echo "\$pass2Se =" . "\"цифра второго разряда из \$pass2\" . \"число третьего разряда из \$pass2\" . \"число первого разряда из \$pass2\"" . " = $pass2Se";
    }
?>