<?php
    $a = "семь";
    $b = "четыре";
    
    // Преобразуемы строковое значение переменной а в числовое
    if ($a === "ноль") $a = 0;
    else if ($a === "один") $a = 1;
    else if ($a === "два") $a = 2;
    else if ($a === "три") $a = 3;
    else if ($a === "четыре") $a = 4;
    else if ($a === "пять") $a = 5;
    else if ($a === "шесть") $a = 6;
    else if ($a === "семь") $a = 7;
    else if ($a === "восемь") $a = 8;
    else if ($a === "девять") $a = 9;

    // Преобразуемы строковое значение переменной b в числовое
    if ($b === "ноль") $b = 0;
    else if ($b === "один") $b = 1;
    else if ($b === "два") $b = 2;
    else if ($b === "три") $b = 3;
    else if ($b === "четыре") $b = 4;
    else if ($b === "пять") $b = 5;
    else if ($b === "шесть") $b = 6;
    else if ($b === "семь") $b = 7;
    else if ($b === "восемь") $b = 8;
    else if ($b === "девять") $b = 9;

    //складываем и выводим результат
    $sum = $a + $b;
    echo $sum;

    //делаем вывод о размере числа по его разрядности
    if ($sum >= 10) echo "<br> большое число";
    else echo "<br> маленькое число";
?>