<?php
    // Изучение PHP для начинающих | Урок #3 - Пишем "Hello World!"
    echo "Hello World!<br>"; // Выводим надпись "Hello World!"
    echo "Русский текст"; // Выводим надпись "Русский текст"



    // Изучение PHP для начинающих | Урок #4 - Комментарии в PHP
    echo "<br><br>"; // Добавляем оступ в две строки между резделами уроков
    echo "Hi!"; // Эта строчка выводит Hi!
    /*
        Комментарий №1
        Комментарий №2
        Комментарий №3
    */
    echo "Hi!"; // Эта строчка выводит Hi!



    // Изучение PHP для начинающих | Урок #5 - Переменные и их типы
    echo "<br><br>"; // Добавляем оступ в две строки между резделами уроков
    $myNumber = 45; // Объявление переменной и занесение в неё значения типа int
    $float = -3.25; // Объявление переменной и занесение в неё значения типа float
    $string = "Hello World!"; // Объявление переменной и занесение в неё значения типа string
    $bool = true; // Объявление переменной и занесение в неё значения типа bool

    echo "Переменная myNumber = $myNumber"; // Вывод на экран значения переменной myNumber
    echo "<br>"; // добавление переноса между строками
    echo "Переменная float = $float"; // Вывод на экран значения переменной float
    echo "<br>"; // добавление переноса между строками
    echo "Переменная string = $string"; // Вывод на экран значения переменной string
    echo "<br>"; // добавление переноса между строками
    echo "Переменная bool = $bool"; // Вывод на экран значения переменной bool
    echo "<br>"; // добавление переноса между строками
    $myNumber = 12; // переопределение переменной myNumber
    echo "Переменная myNumber = $myNumber"; // Вывод на экран значения переменной myNumber



    //Изучение PHP для начинающих | Урок #6 - Константы
    echo "<br><br>"; // Добавляем оступ в две строки между резделами уроков
    echo PHP_VERSION; // вывод информации о используемой версии PHP из зарезервированной константы PHP_VERSION

    define("PI", 3.14); // Обявление константы "PI" со значением "3.14"
    echo "<br>"; // добавление переноса между строками
    echo PI; // вывод на экран значения константы "PI"
    echo "<br>"; // добавление переноса между строками
    echo defined("PI"); // Вывод на экран информации, была ли ранее объявлена константа с именем "PI"



    //Изучение PHP для начинающих | Урок #7 - Арифметические операции
    echo "<br><br>"; // Добавляем оступ в две строки между резделами уроков
    $x = 32;  // Объявление переменной и занесение в неё значения типа int
    $y = 22.13; // Объявление переменной и занесение в неё значения типа float
    $summm = $x + $y; // Обявление переменной summm и присваивание ей значения суммы x и y
    $diff = $x - $y; // Обявление переменной diff и присваивание ей значения разности x и y
    $mult = $x * $y; // Обявление переменной mult и присваивание ей значения умножения x на y
    $dil = $x / $y; // Обявление переменной dil и присваивание ей значения деления x на y

    echo "Сумма из $x и $y = $summm<br>"; // вывод на экран значения результата соответствующей операции
    echo "Разница из $x и $y = $diff<br>"; // вывод на экран значения результата соответствующей операции
    echo "Умножение из $x и $y = $mult<br>"; // вывод на экран значения результата соответствующей операции
    echo "Деление из $x и $y = $dil<br>"; // вывод на экран значения результата соответствующей операции

    $z = 12; // Объявление переменной и занесение в неё значения типа int
    $ostatok = $x % $z; // Обявление переменной ostatok и присваивание ей значения остатка деления x на z
    echo "Остаток от деления $x и $z = $ostatok<br>"; // Вывод на экран значения результата соответствующей операции

    $q = 400; // Объявление переменной и занесение в неё значения типа int
    $q /= 10; // деление переменной q на 10
    echo "$q<br>"; // вывод на экран значения результата соответствующей операции
    $q = $q + 1; // сложение переменной q с 1
    $q += 1; // сложение переменной q с 1
    echo "$q"; // вывод на экран значения результата соответствующей операции



    //Изучение PHP для начинающих | Урок #8 - Строковые операции
    echo "<br><br>"; // Добавляем оступ в две строки между резделами уроков
    $str_1 = "<b>Первая строка</b> <input type=\"text\" />"; // Объявление строковой переменной включающей html теги внутри себя и пример возможности использования ковычек внутри строки
    $str_2 = "<i>Вторая строка</i>"; // Объявление строковой переменной включающей html теги внутри себя

    echo $str_1 . " " . $str_2 . " \" \\"; // Вывод на экран строки полученной с использованием конкатенации
    echo ' \' '; // вывод на экран символа '



    //Изучение PHP для начинающих | Урок #9 - Логические операции
    echo "<br><br>"; // Добавляем оступ в две строки между резделами уроков
    $x = 12; // Объявление переменной и занесение в неё значения типа int
    $y = 34; // Объявление переменной и занесение в неё значения типа int
    $z = 4.25; // Объявление переменной и занесение в неё значения типа float

    $bool_1 = $x != $z; // Объявление переменной и занесение в неё значения логической операции
    $bool_2 = $x <= $y; // Объявление переменной и занесение в неё значения логической операции

    echo $bool_1 . "<br>" . $bool_2 . "<hr>"; // Вывод на экран строки полученной с использованием конкатенации

    $bool_3 = !($x == $y); // Объявление переменной и занесение в неё значения логической операции
    $bool_4 = $x == $y || $z < $y; // Объявление переменной и занесение в неё значения логической операции
    $bool_5 = $z != $y && $x < $y; // Объявление переменной и занесение в неё значения логической операции
    $bool_6 = $z != $x ^ $y < $z; // Объявление переменной и занесение в неё значения логической операции
    echo "<br>" . $bool_3 . "<br>" . $bool_4 . "<br>" . $bool_5 . "<br>" . $bool_6; // Вывод на экран строки полученной с использованием конкатенации

    $bool = !($x != $y && $z < $x) || $x != $y; // Объявление переменной и занесение в неё значения логической операции
    echo "<br> $bool = !($x != $y && $z < $x) || $x != $y"; // Вывод на экран строки логической операции



    //Изучение PHP для начинающих | Урок #10 - Оператор эквивалентности
    echo "<br><br>"; // Добавляем оступ в две строки между резделами уроков
    $string = "Example"; // Объявление переменной и занесение в неё значения типа float
    $num = 0; // Объявление переменной и занесение в неё значения типа int

    $bool_1 = $string == true; // Объявление переменной и занесение в неё значения операции операции эквивалентности
    echo "$bool_1 = $string == true;"; // Вывод на экран строки логической операции

    $bool_2 = $num == ""; // Объявление переменной и занесение в неё значения операции операции эквивалентности
    echo "<br>$bool_2 = $num == \"\";<hr>"; // Вывод на экран строки логической операции

    $bool_3 = $string === true; // Объявление переменной и занесение в неё значения операции операции эквивалентности
    echo "$bool_3 = $string === true;"; // Вывод на экран строки логической операции

    $bool_4 = $num === ""; // Объявление переменной и занесение в неё значения операции операции эквивалентности
    echo "<br>$bool_4 = $num === \"\";"; // Вывод на экран строки логической операции



    //Изучение PHP для начинающих | Урок #11 - Условные операторы
    echo "<br><br>"; // Добавляем оступ в две строки между резделами уроков
    $x = 10; // Объявление переменной и занесение в неё значения типа int
    $y = 5; // Объявление переменной и занесение в неё значения типа int

    if ($x == $y && $x != 12 && $y == 5 && ($x +5) == 15) // Условие, при выполнение которого должно выводится сообщение "Ура"
        echo "Ура!"; // Вывод соответствующего сообщения
    else if ($x == 15 || $y != 7) { // Условие, при невыполение предыдущего условия, но выполнении текущего выодится соответсвующие число
        $num = 5; // Объявление переменной и занесение в неё значения типа int
        echo "Число № " . $num; // Вывод соответствующего сообщения
    } 
    else { // при невыполении всех перечисленних условий выводится сообщение "Все сработало!"
        echo "<br>";
        echo "Все сработало!"; // Вывод соответствующего сообщения
    }

    if ($x == $y && $x != 12 && $y == 5 && ($x +5) == 15) // Условие, при выполнение которого должно выводится сообщение "Ура"
        echo "Ура!"; // Вывод соответствующего сообщения
    
        $x == $y ? $string = "Да" : $string = "Нет"; // Сокращённая версия условия, при выполнении которого выводится сообщение "Да", а при не выполнении "Нет"
        echo "<br>" . $string; // Вывод соответствующего сообщения


    
    //Изучение PHP для начинающих | Урок #13 - Циклы For, While и Do While
    echo "<br><br>"; // Добавляем оступ в две строки между резделами уроков
    for ($i = 100; $i >= 80; $i -=2) { // Цикл, выполняющийся пока значение переменной i не уменьшиться со 100 до 80 с шагом изменения 2
        if ($i % 5 ==0) continue; // при каждом значении i кратном 5 итерация цикла прерывается
        if ($i <=87) break; // при уменьшении числа i ниже 87 - принудительно останавливаем цикл
        echo "Цикл под номером № $i<br>"; // Вывод соответствующего сообщения
    }

    echo "<br>"; // добавление переноса между строками

    $x = 1; // Объявление переменной и занесение в неё значения типа int

    while ($x <= 10) { // Цикл, выполняющийся пока значение переменной x меньше или равно 10
        echo "Итерация под номером № $x<br>"; // Вывод соответствующего сообщения
        if ($x == 7) //условие, ксли x равно 7 ты выполним вложенный цикл
            for ($y = 0; $y < 5; $y +=3) // Цикл, выполняющийся пока значение переменной y инициализированное значением 0, не превышает 4 с шагом увеличения 3
                echo "Еще одна итерация - $y<br>"; // Вывод соответствующего сообщения
        $x++; // инкремент переменной x
    }

    $z  = 10; // Объявление переменной и занесение в неё значения типа int

    echo "<br>"; // добавление переноса между строками

    do { // Цикл, выполняющийся пока значение переменной z не превышает 4 и выполняется как минимум один раз, даже при условии не выполнения данного правила
        echo "Операция выполнилась только один раз"; // Вывод соответствующего сообщения
        $z++;  // инкремент переменной z
    } while ($z < 5);
?>