<?php
$IP = "192.168.1.1";
//$IP = "3232235777";

$itsDots = false;

// Проверка, задан ли формат "с точками" или нет?
$i = 0;
for ($i = 0; $i <= 14; $i++) {
    if (substr ($IP, $i, 1) == ".") {
        $itsDots = true;
        break;
    }
}

// Если задан формат "с точками" то преобразуем его в число
if ($itsDots) {
    $d1 = 0; // Позиция первой точки
    $d2 = 0; // Позиция второй точки
    $d3 = 0; // Позиция третьей точки

    $len = 14;

    // Поиск позиции первой точки
    $i = 0;
    while ($i <= 14) {
        if (substr ($IP, $i, 1) == ".") {
            $d1 = $i;
            $i++;
            break;
        }
        $i++;
    }

    // Поиск позиции второй точки
    while ($i <= 14) {
        if (substr ($IP, $i, 1) == ".") {
            $d2 = $i;
            $i++;
            break;
        }
        $i++;
    }

    // Поиск позиции третьей точки
    while ($i <= 14) {
        if (substr ($IP, $i, 1) == ".") {
            $d3 = $i;
            $i++;
            break;
        }
        $i++;
    }

    // Разделение андреса на Y1, Y2, Y3, Y4
    $Y4 = substr ($IP, 0, $d1);
    $Y3 = substr ($IP, $d1+1, $d2-$d1-1);
    $Y2 = substr ($IP, $d2+1, $d3-$d2-1);
    $Y1 = substr ($IP, $d3+1, $len-$d3);

    //Преобразование  в число по формуле X = Y1*256^0 + Y2*256^1 + Y3*256^2 + Y4*256^3
    $X = $Y1*256**0 + $Y2*256**1 + $Y3*256**2 + $Y4*256**3;
} 

// Если задан формат "число" то преобразуем его в "с точками"
else {
    // Определяем Y4, Y3, Y2, Y1
    $Y4 = floor($IP / 256**3); // Находим Y4 исходя из формулы $IP = Y1*256^0 + Y2*256^1 + Y3*256^2 + Y4*256^3, используя округление
    $Y3 = floor(($IP - $Y4*256**3) / 256**2); // Находим Y3
    $Y2 = floor(($IP - $Y4*256**3 - $Y3*256**2) / 256); // Находим Y2
    $Y1 = $IP - $Y4*256**3 - $Y3*256**2 - $Y2*256; // Находим Y1

    // Приводим результат к формату ip_4
    $X = "$Y4.$Y3.$Y2.$Y1";
}

// Отображаем результат
echo $X;

?>

